load-testing/dashboard.yml
config:
  target: "http://localhost:3001"
  processor: "./processor.js"
  phases:
    - duration: 5
      arrivalCount: 3
      name: "3 people viewing dashboard"
  payload:
    path: "./staff-all.csv"
    fields:
      - "email"
      - "password"

scenarios:
  - name: "Owner dashboard load"
    flow:
      - post:
          url: "/api/auth/staff-login"
          json:
            email: "{{ email }}"
            password: "{{ password }}"
          afterResponse: "captureCookie"
      - loop:
          - get:
              url: "/api/loadtest/dashboard"
              headers:
                Cookie: "{{ authCookie }}"
          - think: 5
        count: 10